Revit 2026 API

# SolidglassTransmittanceType Enumeration

---

The enumerated type representing the permitted values for the asset property "SolidglassTransmittance" from the "SolidGlass" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum SolidglassTransmittanceType
```
```vb
Public Enumeration SolidglassTransmittanceType
```
```cpp
public enum class SolidglassTransmittanceType
```
```fsharp
type SolidglassTransmittanceType
```

| Member name | Value | Description |
| --- | --- | --- |
| Blue | 3 |  |
| Bluegreen | 4 |  |
| Bronze | 5 |  |
| Clear | 0 |  |
| CustomColor | 6 |  |
| Gray | 2 |  |
| Green | 1 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace